[Timeout] LogicalOperator
main/components/Nav/AppNavbar.js:56:15
               }
             </Nav>
             {
-              currentUser && currentUser.loggedIn && (
-                <>
-                  <Nav.Link as={Link} to="/restaurants">Restaurants</Nav.Link>
-                  <Nav.Link as={Link} to="/ucsbdates">UCSB Dates</Nav.Link>
-                  <Nav.Link as={Link} to="/placeholder">Placeholder</Nav.Link>
-                  <Nav.Link as={Link} to="/ucsborganization">UCSBOrganization</Nav.Link>
-                </>
-              )
+              currentUser && currentUser.loggedIn || <>
+                  <Nav.Link as={Link} to="/restaurants">Restaurants</Nav.Link>
+                  <Nav.Link as={Link} to="/ucsbdates">UCSB Dates</Nav.Link>
+                  <Nav.Link as={Link} to="/placeholder">Placeholder</Nav.Link>
+                  <Nav.Link as={Link} to="/ucsborganization">UCSBOrganization</Nav.Link>
+                </>
             }
             <Nav className="ml-auto">
