[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:19:43
     },
   });
 
-  const onSuccess = (UCSBOrganization) => {
-    toast(
-      `New UCSBOrganization Created - orgCode: ${UCSBOrganization.orgCode}`
-    );
-  };
+  const onSuccess = (UCSBOrganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New UCSBOrganization Created - orgCode: ORG"

Number of calls: 0
