[Timeout] BlockStatement
src/main/utils/useBackend.js:64:91
     }
 };
 
-export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey=null) {
-    const queryClient = useQueryClient();
-
-    return useMutation((object) => wrappedParams(objectToAxiosParams(object)), {
-        onError: (data) => {
-            toast(`${data}`)
-        },
-        // Stryker disable all: Not sure how to set up the complex behavior needed to test this
-        onSettled: () => {
-            if (queryKey!==null)
-             queryClient.invalidateQueries(queryKey);
-        },
-        // Stryker restore all
-        retry: false,
-        ...useMutationParams
-    })
-}
+export function useBackendMutation(objectToAxiosParams, useMutationParams, queryKey=null) {}
 
 
