[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:75:24
           isInvalid={Boolean(errors.orgTranslationShort)}
           {...register("orgTranslationShort", {
             required: "Organization Translation Short is required.",
-            maxLength: {
-              value: 30,
-              message: "Max length 30 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
