[Survived] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:79:60
                             data-testid="RecommendationRequestForm-professorEmail"
                             id="professorEmail"
                             type="text"
-                            {...register("professorEmail", {
-                                required: "professorEmail is required.",
-                                maxLength : {
-                                    value: 30,
-                                    message: "Max length 30 characters"
-                                }
-                            })}
+                            {...register("professorEmail", {})}
                         />
                         <Form.Control.Feedback type="invalid">

[Survived] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:99:42
                             data-testid="RecommendationRequestForm-explanation"
                             id="explanation"
                             type="text"
-                            {...register("explanation", {
+                            {...register("", {
                                 required: "explanation is required.",
                                 maxLength : {

[Survived] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:99:57
                             data-testid="RecommendationRequestForm-explanation"
                             id="explanation"
                             type="text"
-                            {...register("explanation", {
-                                required: "explanation is required.",
-                                maxLength : {
-                                    value: 50,
-                                    message: "Max length 50 characters"
-                                }
-                            })}
+                            {...register("explanation", {})}
                         />
                         <Form.Control.Feedback type="invalid">

[Survived] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:123:30
                             {...register("dateRequested", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateRequested && 'dateRequested is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>

[Survived] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:123:30
                             {...register("dateRequested", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateRequested && 'dateRequested is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>

[Survived] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:138:30
                             {...register("dateNeeded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateNeeded && 'dateNeeded is required. '}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>

[Survived] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:138:30
                             {...register("dateNeeded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateNeeded && 'dateNeeded is required. '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
