[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:31:35
           id="orgCode"
           type="text"
           isInvalid={Boolean(errors.orgCode)}
-          {...register("orgCode", {
-            required: "Organization Code is required.",
-            maxLength: {
-              value: 30,
-              message: "Max length 30 characters",
-            },
-          })}
+          {...register("orgCode", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Organization Code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:55:24
           isInvalid={Boolean(errors.orgTranslation)}
           {...register("orgTranslation", {
             required: "Organization Translation is required.",
-            maxLength: {
-              value: 30,
-              message: "Max length 30 characters",
-            },
+            maxLength: {},
           })}
         />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 30 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:76:23
           type="text"
           isInvalid={Boolean(errors.orgTranslationShort)}
           {...register("orgTranslationShort", {
-            required: "Organization Translation Short is required.",
+            required: "",
             maxLength: {
               value: 30,
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Organization Translation Short is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
