[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.js:52:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationTable")
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationTable")
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   const orgsToShow = orgs
killedBy: UCSBOrganizationIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-Delete-button"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:54:53
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationTable")
+      ButtonColumn("Edit", "primary", editCallback, "")
     );
     columns.push(
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:57:20
       ButtonColumn("Edit", "primary", editCallback, "UCSBOrganizationTable")
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "UCSBOrganizationTable")
+      ButtonColumn("", "danger", deleteCallback, "UCSBOrganizationTable")
     );
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.js:62:25
   }
 
   const orgsToShow = orgs
-    ? orgs.map((org) => {
-        return {
-          ...org,
-          inactive: org.inactive ? "Yes" : "No",
-        };
-      })
+    ? orgs.map((org) => {})
     : [];
 
killedBy: UCSBOrganizationIndexPage tests renders three dates correctly for regular user
statusReason: TypeError: Cannot read properties of undefined (reading 'subRows')
