[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function RestaurantCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (UCSBOrganization) => ({
-    url: "/api/UCSBOrganization/post",
-    method: "POST",
-    params: {
-      orgCode: UCSBOrganization.orgCode,
-      orgTranslationShort: UCSBOrganization.orgTranslationShort,
-      orgTranslation: UCSBOrganization.orgTranslation,
-      inactive: UCSBOrganization.inactive,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (UCSBOrganization) => {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:19:43
     },
   });
 
-  const onSuccess = (UCSBOrganization) => {
-    toast(
-      `New UCSBOrganization Created - Organization Code: ${UCSBOrganization.orgCode}`
-    );
-  };
+  const onSuccess = (UCSBOrganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New UCSBOrganization Created - Organization Code: ORG"

Number of calls: 0

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:34:36
 
   const { isSuccess } = mutation;
 
-  const onSubmit = async (data) => {
-    console.log(data)
-    mutation.mutate(data);
-  };
+  const onSubmit = async (data) => {};
 
   if (isSuccess && !storybook) {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
