[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:22:15
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/UCSBOrganization`,
-      params: {
-        orgCode: id,
-      },
+      params: {},
     }
   );
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:28:34
     }
   );
 
-  const objectToAxiosPutParams = (org) => ({
-    url: "/api/UCSBOrganization",
-    method: "PUT",
-    params: {
-      orgCode: org.orgCode,
-    },
-    data: {
-      orgCode: org.orgCode,
-      orgTranslation: org.orgTranslation,
-      orgTranslationShort: org.orgTranslationShort,
-      inactive: org.inactive,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (orgInit) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganization Updated - Organization Code: 20221"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:42:34
     },
   });
 
-  const onSuccess = (orgInit) => {
-    toast(`UCSBOrganization Updated - Organization Code: ${orgInit.orgCode}`);
-  };
+  const onSuccess = (orgInit) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:43:11
   });
 
   const onSuccess = (orgInit) => {
-    toast(`UCSBOrganization Updated - Organization Code: ${orgInit.orgCode}`);
+    toast(``);
   };
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganization Updated - Organization Code: 20221"
Received: ""

Number of calls: 1

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:67:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDate</h1>
-        {orgInit && (
-          <UCSBOrganizationForm
-            initialContents={orgInit}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:67:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDate</h1>
-        {orgInit && (
-          <UCSBOrganizationForm
-            initialContents={orgInit}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {orgInit || <UCSBOrganizationForm initialContents={orgInit} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: UCSBOrganizationEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="UCSBOrganizationForm-orgCode" id="orgCode" name="orgCode" type="text" /> instead
